# Kaggle Titanic  (vol.1)

In [74]:
import numpy as np
import cv2
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.image as mpimg

from sklearn.svm import LinearSVC
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
#from sklearn.model_selection import KFold
from sklearn.cross_validation import KFold
from sklearn.cross_validation import cross_val_score
from sklearn import cross_validation
from sklearn.model_selection import StratifiedKFold
from sklearn import svm

import glob
import time
from scipy.ndimage.measurements import label
from tabulate import tabulate

%matplotlib inline

## Load Data

In [27]:
train_df = pd.read_csv('input/train.csv')
test_df = pd.read_csv('input/test.csv')
gender_submission_df = pd.read_csv('input/gender_submission.csv')

print('train data number: ', len(train_df))
print('test data number: ', len(test_df))
print('gender submission data number: ', len(gender_submission_df))

train data number:  891
test data number:  418
gender submission data number:  418

In [29]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [31]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [32]:
gender_submission_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

## 1

In [33]:
headers = [c for c in train_df.columns]
headers.insert(0,"ID")
print(tabulate(train_df[0:5], headers, tablefmt="pipe"))

|   ID |   PassengerId |   Survived |   Pclass | Name                                                | Sex    |   Age |   SibSp |   Parch | Ticket           |    Fare | Cabin   | Embarked   |
|-----:|--------------:|-----------:|---------:|:----------------------------------------------------|:-------|------:|--------:|--------:|:-----------------|--------:|:--------|:-----------|
|    0 |             1 |          0 |        3 | Braund, Mr. Owen Harris                             | male   |    22 |       1 |       0 | A/5 21171        |  7.25   | nan     | S          |
|    1 |             2 |          1 |        1 | Cumings, Mrs. John Bradley (Florence Briggs Thayer) | female |    38 |       1 |       0 | PC 17599         | 71.2833 | C85     | C          |
|    2 |             3 |          1 |        3 | Heikkinen, Miss. Laina                              | female |    26 |       0 |       0 | STON/O2. 3101282 |  7.925  | nan     | S          |
|    3 |             4 |          1 |        1 | Futrelle, Mrs. Jacques Heath (Lily May Peel)        | female |    35 |       1 |       0 | 113803           | 53.1    | C123    | S          |
|    4 |             5 |          0 |        3 | Allen, Mr. William Henry                            | male   |    35 |       0 |       0 | 373450           |  8.05   | nan     | S          |

In [34]:
def convert_dummies(df, key):
    dum = pd.get_dummies(df[key])
    ks = dum.keys()
    print("Removing {} from {}...".format(ks[0], key))
    dum.columns = [key + "_" + str(k) for k in ks]  
    df = pd.concat((df, dum.ix[:,1:]), axis=1)
    df = df.drop(key, axis=1)
    return df

train_df = convert_dummies(train_df, "Name")
train_df = convert_dummies(train_df, "Pclass")
train_df = convert_dummies(train_df, "Sex")
train_df = convert_dummies(train_df, "Cabin")
train_df = convert_dummies(train_df, "Embarked")

Removing Abbing, Mr. Anthony from Name...
Removing 1 from Pclass...
Removing female from Sex...
Removing A10 from Cabin...
Removing C from Embarked...

/Users/yoheitaonishi/.pyenv/versions/anaconda3-5.0.0/envs/jupyter/lib/python3.6/site-packages/ipykernel_launcher.py:6: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [35]:
train_df['Age'] = train_df.Age.fillna(train_df.Age.median())

In [37]:
train_df.head

# 使用しない変数をドロップ
train_df = train_df.drop("Ticket", axis=1)

In [82]:
### cross_validationでスコアを出せばKFoldやらなくてよいので不要

# http://scikit-learn.org/stable/modules/generated/sklearn.model_selection.KFold.html
#kf = KFold(len(train_df), n_folds=5, shuffle=False)
#for tr, ts in kf:
#    print("%s %s" % (tr, ts))

#skf = StratifiedKFold(n_splits=5)
#for train_index, test_index in skf.split(X_train, y_train):
    #print("X_train:",X_train.loc[train_index])
    #print("y_train:",y_train.loc[train_index])
    #print("X_test:",X_train.loc[test_index])
    #print("y_test:",y_train.loc[test_index])
    #print("-----")

In [ ]:
X_train = train_df.drop("Survived", axis=1)
y_train = train_df.Survived

In [81]:
clf = svm.SVC(kernel='rbf', C=1)
scores = cross_validation.cross_val_score(clf, X_train, y_train, cv=5,)
print("scores: ", scores)
print("Accuracy: %0.2f (+/- %0.2f)" % (scores.mean(), scores.std() * 2))

scores:  [0.41899441 0.43575419 0.44382022 0.47752809 0.62711864]
Accuracy: 0.48 (+/- 0.15)

In [83]:
# パラメーターを修正する
clf = svm.SVC(kernel='linear', random_state=0, gamma=0.05, C=1)
scores = cross_validation.cross_val_score(clf, X_train, y_train, cv=5,)

print("scores: ", scores)
print("Accuracy: %0.2f (+/- %0.2f)" % (scores.mean(), scores.std() * 2))

scores:  [0.79888268 0.81005587 0.79213483 0.76966292 0.82485876]
Accuracy: 0.80 (+/- 0.04)

## 改善できる可能性があるもの
* データの前処理の見直しをする。Ticketに関しては理解するのに時間がかかると判断したため、今回はドロップしている。
* xgboostを使ったパラメーターチューニングすれば精度は上がることが予想される。今回は単純に入力しては削除して検証したが、総当たり的に検証した方がよい。
* IPyhotn Clusterを導入する。以前は導入していたが、PCを変更したため設定ができていなかった。一回学習させるのに時間がかかってしまうため、気軽に学習を回せなかった。
* 他のアルゴリズムの検証をする。今回はSVCに絞ってパラメーターチューニングをしたが、他のアルゴリズムで実装した方が精度が高い可能性がある。個人的には、どのアルゴリズムが良いのか当たりをつけることが今後の課題と認識している。
* うまく75%以下の数値が算出できなかった。（そのため課題1は達成できていないが、課題2を達成したために今回はスキップした）